import React from "react";
import styled from "styled-components";

const Container = styled.div`
  display: flex;
  flex-direction: column;
  justify-content: flex-start;
  align-items: flex-start;
  width: 100%;
  height: 100%;
  overflow-y: scroll;
  ::-webkit-scrollbar {
    width: 10px;
    height: 10px;
  }
  ::-webkit-scrollbar-thumb {
    background-color: white;
    border-radius: 5px;
  }
`;

const Bigtext = styled.div`
  font-size: 25.92px;
  margin-bottom: 20px;
  flex-shrink: 0;
  padding: 0 20px;
  font-family: "MaplestoryOTFBold";
`;

const Texts = styled.div`
  font-size: 14.4px;
  line-height: 1.5;
  font-family: "Pretendard-Regular";
  margin: 20px 0;
  padding: 0 20px;
  flex-shrink: 0;
`;

const Mbe = () => {
  return (
    <Container>
      <Bigtext> 대중매체에서의 곰벌레!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!</Bigtext>
      <Texts>
        내셔널지오그래픽의 명작 우주다큐멘터리 코스모스에 등장하였다. 어쩌면
        극한의 우주에서도 살아갈수 있는 생물로.
      </Texts>
      <Texts>
        쥬로링 동물탐정에서 악역인 정글남이 이 동물로 변신하게 되었다. 최강의
        생물로 변신하고 싶어 했더니 곰벌레가 된 것. 어떤 의미에선 최강이 맞다.
        나중에 수분이 부족해서 쪼그라들었지만.
      </Texts>
      <Texts>
        그동안 인류는 너무 춥거나, 너무 덥거나, 지나치게 염도가 높거나, 방사능에
        오염되었거나, 건조하거나, 혹은 진공상황이거나 하는 등의 극한상황에서는
        생명이 존재할 수 없다고 생각했다. 그간의 찰스 다윈이 진화를 발견하고
        진화가 어떤 식으로 이루어졌는지에 대한 이론인 진화론을 내세운 지 백여 년
        뒤로 진화가 어떻게 이루어졌는가에 대한 연구는 활발하게 이루어져 많은
        증명이 있었지만 '최초의 생명 혹은 생명의 근원지가 어디이며 생명의
        시발점이 어디인가'라는 주제의 연구는 아직 계속 진행중이다. 그 와중에
        완보동물의 발견은 최초의 유기체는 어쩌면 지구가 아니라 우주에서 지구로
        흘러들어온 게 아닐까 하는 추론도 가능하게 해주었다. 위에 연구와 비슷한
        배경으로 한 영화도 나왔다. 그 영화 이름은 하빈저 다운이다. 매우
        고어고어하다.
      </Texts>
      <Texts>
        앤트맨 후반부에서 스콧 랭이 원자보다 작은 크기로 줄어드는 과정을
        보여주는 장면 중 슬쩍 지나쳐간다. 후속작인 앤트맨과 와스프에서도
        언급되는데, 아내를 구하기 위해 양자 영역으로 들어가기 직전 초소형 상태로
        잠시 떠다니던 행크 핌의 우주선을 발견하고 잡아 먹으려 했으며, 양자
        영역으로 들어가려는 스콧 랭에게 재닛 밴 다인이 곰벌레 서식지에 가면
        잡아먹힐 수도 있으니 조심해야 한다고 한다.
      </Texts>
      <Texts>
        전설의 용자 다간 15화에서 곰벌레를 모티브로 한 괴수가 등장한다. 빔를
        흡수해 본체와 똑같은 분신을 만들고, 입에서는 산을 뿜고, 앞다리는 드릴이
        되는 강력한 괴수. 다만 냉기에 약한지 다간 X의 브레스트 브리징을 맞고
        얼어 버린 틈을 타 스카이 세이버가 도륙내는 것으로 폭발사산.
      </Texts>
      <Texts>
        와이랩이 기획한 슈퍼스트링 세계관 웹툰인 테러맨에서 빌런인 이현성이 빈사
        상태에서 이매진 프로젝트로 부활을 했는데 모델명이 곰벌레이다. 엄청난
        생존력과 재생력 그리고 괴력을 보인다. 이는 심연의 하늘에서 언급되는
        강의철이 주도한 프로젝트 하늘의 시초가 되었다.
      </Texts>
      <Texts>
        {" "}
        스타 트렉: 디스커버리에 우주의 완보류 생물이 등장한다. 살상 셋팅의
        페이저를 맞아도 버티고, 환경 적응성이 뛰어나며, 우주선의 내벽을 찢어발길
        수 있는 강력한 손톱을 가지고 있어 처음에는 '난도자(Ripper)라는 이름이
        붙여진 채 무기화 연구의 대상이 되었었다. 하지만, 마이클 버냄의 연구결과
        실제로 공격적인 생물이 아니고 균사체 네트워크를 구축한 특수한 우주
        균사체의 DNA 일부를 받아들여 균사체 네트워크를 통해 항성간 이동을 할 수
        있는 생물임이 밝혀져, U.S.S 디스커버리가 균사체 네트워크를 이용한 포자
        드라이브(Spore Drive)를[10] 이용할 수 있게 되었다. 주변의 DNA를
        받아들인다는 주장을 반영한 설정인 것 같다.{" "}
      </Texts>
      <Texts>
        {" "}
        유튜브 채널 Tierzoo는 곰벌레는 모두의 예상과는 달리 완전체 탱커가 절대
        아니고, 자신을 확실하게 죽일 수 있는 물리 공격을 제외한 모든 것에
        저항력을 쓸데없이 갖춘 비효율적인 생명체라고 깠다. 곰벌레들은 실제로
        종종 실험실의 핀셋에 몸이 터져 죽을 만큼이나 물리적인 힘엔 취약하다고.{" "}
      </Texts>
      <Texts>
        {" "}
        사우스 파크 시즌 21 8화에서는 사우스 파크 초등학교의 장애아동들의 과학
        박람회에서 지미 발머와 티미 버치가 곰벌레들을 훈련시키는 실험을 하자
        자기들보다 훨씬 좋은 실험을 해서 여학생들의 관심이 다 그쪽으로 쏠릴
        거라고 생각한 네이선[11]이 자기 친구이자 사실상 부하처럼 부려먹는 밈지와
        함께 밤에 몰래 실험을 망치기 위해 잠입해 이것저것 집어넣었으나 오히려
        그걸로 인해 곰벌레들이 지성을 보이기 시작하고 그걸 알게 된 NFL이 찾아와
        떠나가는 팬들을 곰벌레들로 대체 시키려고 했고 거의 성공하였으나 에릭
        카트먼에 의해 타락하여 카트먼 같은 성격이 되어버린 하이디 터너가 자기는
        토요일에 학교 나와 박람회에서 해설맞기 싫단 이유[12]로 곰벌레들이
        들어있는 어항의 물을 다 마셔버려서 실패하고 NFL은 곰벌레 대신에 원래
        네이선이 진행했던 화산모형을 가져간다. 그리고 그걸 보고 대단해하는 NFL
        회장으로 마무리.{" "}
      </Texts>
      <Texts>
        n으로 마무리. 네이버 웹툰 덴마의 [덴마 프로젝트]의 시작점으로 밝혀졌다.
        덴마 3-294화참조. 해당화에선 물곰 프로젝트로 나온다. 참고로 곰벌레의
        영문 명칭이 'Water Bear(물곰)'. 물곰의 유전자에서 인간몸의 한계를
        극복하고자 시작한 프로젝트가 결국 덴마 프로젝트가 되었고 그중 성공한
        샘플이었던 덴마가 주인공이 된다.{" "}
      </Texts>
      <Texts>
        {" "}
        스타☆트윙클 프리큐어 10화에서 혹성 쿠마린을 보고 프룬스가 지구에 살고
        있는 생물 중 비슷한 생물이 있다면서 언급했다
      </Texts>
    </Container>
  );
};

export default Mbe;
